dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
/* MP WRAPPING FUNCTIONS*/

STATIC mp_obj_t mp_machine_i2c_is_ready(mp_obj_t self, mp_obj_t dev_addr)
{
    uint8_t addr = mp_obj_get_int(dev_addr);
    if (machine_hard_i2c_is_ready((mp_obj_base_t *)self, addr) == true)
    {
        return mp_const_true;
    }
    else
    {
        return mp_const_false;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(mp_machine_i2c_is_ready_obj, mp_machine_i2c_is_ready);

STATIC mp_obj_t mp_machine_i2c_start(mp_obj_t self)
{

    machine_hard_i2c_start((mp_obj_base_t *)self);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mp_machine_i2c_start_obj, mp_machine_i2c_start);

STATIC mp_obj_t mp_machine_hard_i2c_readinto(mp_obj_t self, mp_obj_t buf, mp_obj_t nack)
{
    // get read buffer pointer from mp
    mp_buffer_info_t i2c_read_buf;
    mp_get_buffer_raise(buf, &i2c_read_buf, MP_BUFFER_WRITE);

    // get NACK
    uint8_t int_nack = mp_obj_get_int(nack);

    // pass to c-interface function
    machine_hard_i2c_readinto(self, (uint8_t *)i2c_read_buf.buf, i2c_read_buf.len, int_nack);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(mp_machine_hard_i2c_readinto_obj, mp_machine_hard_i2c_readinto);

STATIC mp_obj_t mp_machine_hard_i2c_write(mp_obj_t self_in, mp_obj_t wr_buf)
{
    // get write buffer
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(wr_buf, &i2c_data, MP_BUFFER_READ);

    // write bytes to bus and return number of acks
    return mp_obj_new_int((mp_int_t)machine_hard_i2c_write((mp_obj_base_t *)self_in, (uint8_t *)i2c_data.buf, i2c_data.len));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(mp_machine_hard_i2c_write_obj, mp_machine_hard_i2c_write);

STATIC mp_obj_t mp_machine_hard_i2c_recv(size_t n_args, const mp_obj_t *args)
{

    // casting Micropython data types to c data types
    uint8_t int_nbytes = mp_obj_get_int(args[1]);
    uint8_t int_dev_address = 0;
    uint32_t int_timeout_val = 5000;

    vstr_t vstr;
    vstr_init_len(&vstr, int_nbytes);

    if(n_args == 3)
    {
        int_dev_address = mp_obj_get_int(args[2]);
    }

    if(n_args == 4)
    {
        int_dev_address = mp_obj_get_int(args[2]);
        int_timeout_val = mp_obj_get_int(args[3]);

    }
    // read bytes into vstr buffer
    machine_hard_i2c_recv((mp_obj_base_t *)args[0], int_dev_address, (uint8_t *)vstr.buf, vstr.len, int_timeout_val);

    // return vstr buffer
    return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_recv_obj, 2, 4, mp_machine_hard_i2c_recv);

STATIC mp_obj_t mp_machine_hard_i2c_mem_read(size_t n_args, const mp_obj_t *args)
{
    uint8_t int_mem_addr_size = 8;
    uint32_t int_timeout = 5000;
    // casting Micropython data types to c data types

    // get buffer to read to
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(args[1], &i2c_data, MP_BUFFER_READ);

    // get device address
    uint8_t int_dev_address = mp_obj_get_int(args[2]);

    // get stop
    uint16_t int_mem_addr = mp_obj_get_int(args[3]);

    if (n_args == 5)
    {
        int_timeout = mp_obj_get_int(args[4]);
    }

    if (n_args == 6)
    {
        int_timeout = mp_obj_get_int(args[4]);
        int_mem_addr_size = mp_obj_get_int(args[5]);

        if (!((int_mem_addr_size == 16) || (int_mem_addr_size == 8)))
        {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "addr_size can only be 8 or 16 bits"));
        }
    }

    // pass to c-interface function
    machine_hard_i2c_mem_read(args[0], i2c_data.buf, int_dev_address, int_mem_addr, i2c_data.len, int_timeout, int_mem_addr_size);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_mem_read_obj, 4, 6, mp_machine_hard_i2c_mem_read);

STATIC mp_obj_t mp_machine_hard_i2c_send(size_t n_args, const mp_obj_t *args)
{
    // casting Micropython data types to c data types
    uint8_t int_nbytes = mp_obj_get_int(args[1]);
    uint8_t int_dev_address = 0;
    uint32_t int_timeout_val = 5000;

    vstr_t vstr;
    vstr_init_len(&vstr, int_nbytes);

    if(n_args == 3)
    {
        int_dev_address = mp_obj_get_int(args[2]);
    }

    if(n_args == 4)
    {
        int_dev_address = mp_obj_get_int(args[2]);
        int_timeout_val = mp_obj_get_int(args[3]);
    }

    // calling I2C-Send Function
    machine_hard_i2c_send((mp_obj_base_t *)args[0], int_dev_address, vstr.len, (uint8_t *)vstr.buf, int_timeout_val);

    return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_send_obj, 2, 4, mp_machine_hard_i2c_send);

/* Write Function */

STATIC mp_obj_t mp_machine_hard_i2c_mem_write(size_t n_args, const mp_obj_t *args)
{
    // casting Micropython data types to c data types
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(args[1], &i2c_data, MP_BUFFER_READ);
    uint8_t int_dev_address = mp_obj_get_int(args[2]);
    uint16_t int_mem_address = mp_obj_get_int(args[3]);
    uint32_t int_timeout = 5000;
    uint8_t int_mem_addr_size = 8;

    if (n_args == 5)
    {
        int_timeout = mp_obj_get_int(args[4]);
    }
    else if (n_args == 6)
    {
        int_timeout = mp_obj_get_int(args[4]);
        int_mem_addr_size = mp_obj_get_int(args[4]);

        if (!((int_mem_addr_size == 16) || (int_mem_addr_size == 8)))
        {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "addr_size can only be 8 or 16 bits"));
        }
    }
    // calling I2C-Send Function
    machine_hard_i2c_mem_write(args[0], int_dev_address, int_mem_address, i2c_data.len, (uint8_t *)i2c_data.buf, int_timeout, int_mem_addr_size);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_mem_write_obj, 4, 6, mp_machine_hard_i2c_mem_write);

/* Scan Function */

STATIC mp_obj_t mp_machine_hard_i2c_scan(mp_obj_t self)
{
    return machine_hard_i2c_scan(self);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mp_machine_hard_i2c_scan_obj, mp_machine_hard_i2c_scan);

/* DeInit Function */

STATIC mp_obj_t mp_machine_hard_i2c_deinit(mp_obj_t self_in)
{
    i2c_deinit(&self_in);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mp_machine_hard_i2c_deinit_obj, mp_machine_hard_i2c_deinit);

